cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/apache'
tap 'homebrew/bundle'
tap 'homebrew/command-not-found'
tap 'homebrew/core'
tap 'homebrew/dupes'
tap 'homebrew/services'
tap 'homebrew/versions'

cask 'java'
cask 'atom'
cask 'brave'
cask 'caffeine'
cask 'dbeaver-enterprise'
cask 'eve'
cask 'flux'
cask 'google-chrome'
cask 'gimp'
cask 'gitup'
cask 'hipchat'
cask 'iterm2'
cask 'skype'
cask 'skitch'
cask 'slack'
cask 'spectacle'
cask 'visual-studio-code'
cask 'virtualbox'
cask 'vlc'
cask 'XQuartz'

brew 'ack'
brew 'atk'
brew 'aspell'
brew 'autoconf'
brew 'autojump'
brew 'automake'
brew 'awscli'
brew 'cmake'
brew 'coreutils'
brew 'editorconfig'
brew 'elixir'
brew 'ffmpeg'
brew 'fontconfig'
brew 'fontforge'
brew 'freetype'
brew 'gettext'
brew 'go'
brew 'icdiff'
brew 'libcaca', args: ['with-imlib2']
brew 'libevent'
brew 'libgit2'
brew 'libpng'
brew 'librsvg'
brew 'libtiff'
brew 'maven'
brew 'macvim'
brew 'memcached'
brew 'mongodb'
brew 'mono'
brew 'nvm'
brew 'ocaml'
brew 'opam'
brew 'openssl'
brew 'readline'
brew 'pkg-config'
brew 'postgresql'
brew 'python'
brew 'ruby-build'
brew 'rbenv'
brew 'rpm'
brew 'sbt'
brew 'scala'
brew 'sdl2'
brew 'sdl2_mixer'
brew 'sslyze'
brew 'the_silver_searcher'
brew 'tmux'
brew 'ttyrec'
brew 'ttygif'
brew 'tree'
brew 'unrar'
brew 'vim'
brew 'watch'
brew 'watchman'
brew 'wget'
brew 'x264'
brew 'youtube-dl'
brew 'zsh'
